{
  "backend/main.mo": "Main Motoko actor defining company/role management, personnel, tasks, and announcements with access control integration, data storage maps, and authorization helper functions for multi-tenant ERP system.",
  "feature_evidence.json": "Feature evidence report documenting three authentication flow fixes for CompanyLogin, ManagerLogin, and EmployeeLogin components to trigger Internet Identity authentication windows.",
  "frontend-file-summaries.txt": "JSON summary of frontend files describing login pages, authentication hooks, routing, and styling with OKLCH color tokens for Turkish ERP interface.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH-based design tokens defining light and dark mode color schemes using warm neutral and amber tones for the ERP interface.",
  "frontend/index.html": "HTML entry point for the ERP application with Turkish title and root div mounting point for React.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with routes for login pages, role-based dashboards (owner/manager/employee), and module pages (personnel, tasks, announcements, reports).",
  "frontend/src/components/CompanyRegistrationForm.tsx": "Company registration form component allowing owners to register new companies with ID, name, and owner details, then saving user profile and navigating to owner dashboard.",
  "frontend/src/components/Layout/DashboardLayout.tsx": "Dashboard layout wrapper component rendering Header, Sidebar, and main content outlet with gradient background styling.",
  "frontend/src/components/Layout/Header.tsx": "Header component displaying ERP branding, user profile with role badge, and logout button that clears authentication and query cache.",
  "frontend/src/components/Layout/Sidebar.tsx": "Renders a role-based navigation sidebar with different menu items for Owner, Manager, and Employee roles, using active route highlighting and permission-based visibility.",
  "frontend/src/components/PermissionGate.tsx": "A simple wrapper component that conditionally renders children based on a permission boolean, with optional fallback content.",
  "frontend/src/components/RoleBadge.tsx": "Displays a styled badge component showing user role (Owner/Manager/Employee) with role-specific colors in light and dark modes.",
  "frontend/src/components/StatusBadge.tsx": "Displays a styled badge for task status (Pending/In Progress/Completed) with status-specific colors in light and dark modes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAuthRedirect.ts": "Redirects authenticated users to their role-specific dashboard (owner/manager/employee) based on their user profile.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking for the application.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API operations including user profiles, company registration, invites, personnel management, tasks, and announcements.",
  "frontend/src/hooks/useUserPermissions.ts": "Extracts and exposes granular module permissions (personnel, task, announcement, report) from the current user profile as boolean flags.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark theme colors using an amber/brown color palette.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AnnouncementManagement.tsx": "Announcement management page allowing users to view, create, and delete announcements with role-based targeting. Includes permission checks and a dialog form for adding new announcements.",
  "frontend/src/pages/CompanyLogin.tsx": "Company owner login page using Internet Identity authentication. Redirects owners to their dashboard or shows registration form for new users, with role validation.",
  "frontend/src/pages/EmployeeDashboard.tsx": "Employee dashboard displaying navigation cards for tasks, announcements, and reports based on user permissions. Validates employee role before rendering.",
  "frontend/src/pages/EmployeeLogin.tsx": "Employee login page with Internet Identity authentication and invite code redemption form for new employees. Validates employee role and handles invite code submission.",
  "frontend/src/pages/EmployeeManagement.tsx": "Personnel management page for managers and owners to view employee lists and generate invite codes. Includes a dialog for creating 7-day valid invite codes with copy functionality.",
  "frontend/src/pages/LoginSelection.tsx": "Landing page that displays three login options (Company, Manager, Employee) as cards with icons and navigation buttons to their respective login pages.",
  "frontend/src/pages/ManagerDashboard.tsx": "Manager role dashboard that displays navigation cards for managing employees, tasks, announcements, and reports based on user permissions.",
  "frontend/src/pages/ManagerLogin.tsx": "Manager login page with Internet Identity authentication and invite code form for new managers to join a company.",
  "frontend/src/pages/ManagerManagement.tsx": "Owner-only page for managing company managers, displaying a list of managers and providing functionality to generate invite codes for new managers.",
  "frontend/src/pages/OwnerDashboard.tsx": "Company owner dashboard with navigation cards to manage company managers, view reports, and access all personnel.",
  "frontend/src/pages/PersonnelManagement.tsx": "Personnel list page displaying all company employees in a table with name, role, and active status, accessible to users with personnel view permissions.",
  "frontend/src/pages/ReportingModule.tsx": "React component for the Reporting Module that displays three tabbed reports (Personnel Activity, Task Completion, Performance Summary) with role-based access control and navigation back to role-specific dashboards.",
  "frontend/src/pages/TaskManagement.tsx": "React component for Task Management that allows users with taskView permission to view, add, update, and delete tasks with assignees, priorities, dates, and status tracking using a table and dialog interface.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for borders/shadows/animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a Turkish multi-tenant ERP system with Internet Identity authentication, three-tier role hierarchy, module-based RBAC, and a known issue with authentication not triggering on login screens."
}